import os
from typing import List

# Токены и API ключи
BOT_TOKEN = "7623849333:AAHJuwEshsK204OYwBRC2ZgrWjS9l7_F8Ro"  # Токен бота от @BotFather
CRYPTO_PAY_API_TOKEN = "335460:AA8SyvLO290vdLcodSDYVykIKg5eYdWGpiC"  # Токен приложения от @CryptoBot

# Админы и группы
ADMIN_IDS = [8115432365]  # Айди админов через запятую

# ID групп для хранения истории сообщений
HISTORY_GROUP_IDS = [
    -1002467764642,  # Основная группа
    -1002353748102,  # Резервная группа 1
    -1002460477207,  # Резервная группа 2 
    -1002300596890,  # Резервная группа 3
    -1002498479494,  # Резервная группа 4
    -1002395727554,  # Резервная группа 5
    -1002321264660   # Резервная группа 6
]